//
//  main.c
//  位运算
//
//  Created by lzxuan on 15/12/31.
//  Copyright (c) 2015年 lzxuan. All rights reserved.
//

#include <stdio.h>
/*
 二进制的 位运算符
 &  按位 相与
 与0相与 为0
 与1相与 就是本身 
 
 3&5 
 0000 0011
 0000 0101
 ---------
 0000 0001

 
 |  按位 相或
 与1相或 是1
 与0相或 就是本身
 
 3|5---》3二进制每一位 跟5 的二进制每一位相或
 0000 0011
 0000 0101
 ---------
 0000 0111
 
 ^  按位 异或
 两位 相同 为0 不同 为1
 与1 异或  取反
 
 与0 异或  就是本身
 
 3^5
 0000 0011
 0000 0101
 ---------
 0000 0110
 ~ 按位取反
 ~3
  0000 0011
 -----------
  1111 1100
 
 当前这个数+取反之后的数 == -1
 
 <<
 
 1<<2  -》1左移2位
 0000 0100
 二进制每一位 都左移,右边补0
 
 >>
 
 1>>1
 0000 0001
 有符号数的右移  右边低位舍去 高位 符号位是什么补什么
 -1>>1
 1111 1111
 
 有符号数的右移  右边低位舍去 高位 符号位是什么补什么
 
 
 无符号数的右移  右边低位舍去 高位 永远补0
 
 */

//位数都是从0开始  32位数 bit31....bit0

//有一个数num   将num的第n位清零
//                   第n位置为1
//                   第n位取反
//分别用宏实现
/*
 0000 0101
 0000 1000
 */
#define CLEAR_BIT(num,n)  num &=~(1<<n)
#define SET_BIT(num,n)  num |= (1<<n)
#define OPP_BIT(num,n)  num  ^= (1<<n)

int main(int argc, const char * argv[]) {
    
    printf("%d\n",3&5);//1
    printf("%d\n",3|5);//7
    printf("%d\n",3^5);//7
    printf("%d\n",~3);//-4
    printf("%d\n",~6);//-7
    printf("%d\n",~-9);//8
    printf("%d\n",1<<2);//4
    
    int a = 1;
    printf("%d\n",a>>1);
    int b = -1;
    printf("%d\n",b>>1);
    
    
    unsigned int x = 0xffffffff;
    printf("%#x\n",x>>1);
    x = 1;
    printf("%#x\n",x>>1);
    
    return 0;
}



