//
//  main.c
//  C2_冒泡排序
//
//  Created by lzxuan on 15/12/28.
//  Copyright © 2015年 lzxuan. All rights reserved.
//

#include <stdio.h>
/*
 冒泡
 
 int a[5] = {5，4，3，2，1};
 //升序
 每轮都从第一个元素开始，相邻的两个元素进行依次比较，大的放后面(如果a[j] > a[j+1] 那么进行交换)
 
 5 4 3 2 1
 第一轮:从a[0] 开始一次相邻的两个元素比较，a[0]和a[1],a[1]和a[2] a[2]和a[3] a[3]和a[4] ,  大的放后面 (if (a[0]>a[1]) a[0]和a[1]的值交换)
 4 3 2 1 5
 第二轮:从a[0] 开始一次相邻的两个元素比较，a[0]和a[1],a[1]和a[2] a[2]和a[3] 大的放后面 (if (a[0]>a[1]) a[0]和a[1]的值交换)
 3 2 1 4 5
 第三轮:从a[0] 开始一次相邻的两个元素比较，a[0]和a[1],a[1]和a[2]  大的放后面 (if (a[0]>a[1]) a[0]和a[1]的值交换)
 2 1 3 4 5
 第四轮:从a[0] 开始一次相邻的两个元素比较，a[0]和a[1]大的放后面 (if (a[0]>a[1]) a[0]和a[1]的值交换)
 1 2 3 4 5
 */
int main(int argc, const char * argv[]) {
    int a[5] = {14,2,45,65,30};
    
    int len = sizeof(a)/sizeof(a[0]);
    for (int i = 0; i < len-1; i++) {
        //始终 都是从a[0]开始 依次比较相邻的元素
        //1. a[0]和a[1] a[1]和a[2] a[2]和a[3] a[3]和a[4]
        //2. a[0]和a[1] a[1]和a[2] a[2]和a[3]
        //3. a[0]和a[1] a[1]和a[2]
        //4. a[0]和a[1]
        //                    循环次数
        //i = 0 j = 0 1 2 3    4
        //i = 1 j = 0 1 2      3
        //i = 2 j = 0 1        2
        //i+循环次数 = 数组元素个数-1
        //循环次数 = len-1-i
        for (int j = 0;j < len-1-i  ;j++ ) {
            if (a[j] > a[j+1]) { //升序
                //交换
                int tmp = a[j];
                a[j] = a[j+1];
                a[j+1] = tmp;
            }
        }
    }
    for (int i = 0; i < len; i++) {
        printf("%d  ",a[i]);
    }
    printf("\n");
    
    
    return 0;
}







