#include <stdio.h>

int main(void)
{
	//二维数组的初始化 里面的元素 就是一维数组
	int a[2][3] = {
		{1,2,3},
		{4,5,6}
	};
	printf("a[0][0] = %d\n",a[0][0]);//1
	printf("a[0][2] = %d\n",a[0][2]);//3
	printf("a[1][1] = %d\n",a[1][1]);//5
	//还可以这样初始化
	int b[2][3] = {1,2,3,4,5,6};
	int c[2][3] = {1,2};
//	int d[2][] = {1,2,3,4,5,6};//错 
	int d[][3] = {1,2,3,4,5,6};//挨着数组名的[] 里面就是元素个数 ,元素个数初始化的时候可以省，其他[]内容都不能省去
	printf("*****************\n");
	for (int i = 0;i < 2;i++) {
		//打印a[0] -->必须挨个打印元素
		for (int j = 0;j < 3;j++) {
			printf("a[%d][%d] = %d\n",i,j,a[i][j]);
		}
	}

	/*
	 
	 1 2 3 -> a[0]
	 4 5 6 -> a[1]

	 */
	for (int i = 0;i < 2;i++) {
		//打印a[0] -->必须挨个打印元素
		for (int j = 0;j < 3;j++) {
			printf("%d ",a[i][j]);
		}
		printf("\n");
	}

	return 0;
}

