#include <stdio.h>
/*
 14. 将一个正整数分解质因数。例如：输入90,打印出90=2*3*3*5。
 8 = 2*2*2
 15 = 3*5
 16 = 2*2*2*2
 90=2*3*3*5
 
 90%2 -->整除 45
 45%2 不能整除 除数+1
 45%3 能整除 商 15
 15%3 能整除 商 5
 5%3  不能整除 除数+1 
 5%4  不能整除 除数+1
 5%5  整除  除数和被除数一样 结束
 
 
 */
int main(void)
{
    int num;
    scanf("%d",&num);
    printf("%d=",num);
    
    //质因数相乘
    //拿这个数 去 除以 另外 一个数(除数)，能整除就是 因数，不能整除那么除以(除数+1)
    int i = 2;//除数
    while (i <= num) {
        if (num%i == 0) {
            //整除表示 是一个质因数
            if (i == num) {
                printf ("%d",i);
            }else {
                printf ("%d*",i);
            }
            
            num /= i;
        }else {
            i++;//不能整除 除数+1
        }
    }
    printf ("\n");
    

	return 0;
}
